seeed-rm/ArduinoCore-Zephyr/boards.txt
# The MIT License (MIT)

# Copyright (c) 2019 Seeed Technology Inc.

# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:

# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.

# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
# THE SOFTWARE.

rrf9160_pca10090.name=nRF9160 DK Development Kit
rrf9160_pca10090.upload.tool=west
rrf9160_pca10090.upload.protocol=west
rrf9160_pca10090.build.mcu=cortex-m33
rrf9160_pca10090.build.board=rrf9160_pca10090
rrf9160_pca10090.build.f_cpu=32000000L
rrf9160_pca10090.build.core=arduino
rrf9160_pca10090.build.variant=rrf9160_pca10090
rrf9160_pca10090.build.compiler.path=D:\gcc-arm-none-eabi-7-2018-q2-update-win32\bin
rrf9160_pca10090.build.compiler.path.linux=/opt/zephyr-sdk/sysroots/x86_64-pokysdk-linux/usr/bin/arm-zephyr-eabi/
rrf9160_pca10090.build.compiler.triplet=arm-none-eabi
